<?php
/////////////////////////////////////////////////////首先判断条件是否成立，再执行任务

//$sum = 12;//小宠物当前的饥饿程度
//$n=0;//一共喂了几次
//echo "我饿啦:-(";
//echo "<br />";
//while($sum<100){//小宠物的饥饿程度到100，表示小宠,不用继续喂了，没吃饱继续喂食
//    $num = rand(1,20);//随机数，模拟喂食小宠物的小面包
//    $sum = $sum + $num; //小宠物吃小面包
//    echo "<br />";
//    echo $sum;
//    $n=$n+1;
//    if($sum>100){
//        echo '吃饱了';
//    }else{
//        echo "我还没吃饱呢！";
//    }
//}
//echo "终于吃饱啦^_^";
//echo $n;


//////////////////////////////////////////////////////////////do while///先do,然后再判断条件决定是否继续
//$i=1;
//do{
//    echo '在跑第'.$i.'圈';
//    $i++;
//}while($i<=10);
////////////////////////////////////////////////////////////do while之优势/////////////
//$sum  = 0;
//do{
//    $num = rand(1,6);//获取1至6的随机数，模拟掷骰子
//    $sum = $sum  + $num;//前进步长
//}while($num==6);
//echo "do...while例子执行完毕，前进：".$sum ."<br />";


////////////////////////////////////////////////////计算1加到100的和
//for($i=1,$sum=0;$i<=100;$i++){
//    $sum = $sum + $i; //	累加求和
//}
//echo $sum;
/////////////////////while
//$i=1;
//$sum=0;
//while($i<=100){
//    $sum=$sum+$i;
//    $i++;
//}
//echo $sum;
////////////////////////////////////////////////////////////////////////////////////////
///
///
